
/* Presented when a URL cannot be loaded because its scheme isn't understood */
"Don't know how to load URL %@" = "不知道如何载入 URL %@";

/* Presented when an HTTP URL cannot establish a connection with a particular host */
"Could not connect to host %@" = "无法连接到主机 %@";

/* Presented when a response from an HTTP server comes back with a bad format */
"Bad header received from server" = "从服务器接收到的坏标头";

/* Presented when a description of a particular host can't be determined. */
"Can't determine IP address of host: %@" = "不能确定主机 %@ 的 IP 地址";

/* Presented when the host description was found, but a particular port couldn't be opened. */
"Can't get a description of port %d" = "不能获得端口 %d 的描述";

/* Presented when a particular host cannot be contacted via the given port */
"Can't connect to host %@ using port %d" = "不能使用端口 %2$d 连接到主机 %1$@";

/* Presented when an HTTP server comes back with an unknown status code */
"Received unknown HTTP server response %@: %@" = "接收到未知的 HTTP 服务器响应 %@：%@";

/* Presented when an HTTP server returns a failure code */
"HTTP request failed for URL %@:%@" = "对 URL %@ 的 HTTP 请求失败：%@";

/* Presented when the connection to an HTTP server is unexpectedly lost */
"Lost connection to host %@" = "与主机 %@ 的连接已断开";

/* Presented when a file can not be opened for reading (file may not exist) */
"Could not read from %@" = "无法从 %@ 中读取";

/* Presented when a redirection loop has been detected */
"Detected a redirection loop while attempting to load URL %@" = "在试图载入 URL %@ 时检测到重定向循环";

/* Presented when an FTP server hangs up or becomes otherwise unavailable */
"Service unavailable for host %@" = "用于主机“%@”的服务找不到";

/* Presented when the data transfer socket cannot be created for an FTP transfer */
"Couldn't open data connection for URL path: %@" = "未能打开 URL 路径 %@ 的数据连接";

/* Presented when the indicated URL does not locate ane existing object on the server */
"Object not available for specified URL: %@" = "用于特定 URL 的对象找不到：%@";

/* Presented when the FTP server doesn't recognize a particular command */
"FTP command not recognized by host: %@" = "FTP 命令未被主机识别：%@";

/* Presented when the FTP server rejects an authentication */
"User login or password not recognized." = "用户登录或密码未被识别。";

/* Format used to display sizes 100 GB or greater */
"%.0f GB" = "%.0f GB";

/* Format used to display sizes between 100 and 999 KB */
"%.0f KB" = "%.0f KB";

/* Format used to display sizes between 100 and 999 MB */
"%.0f MB" = "%.0f MB";

/* Format used to display a size between 2 and 100 bytes */
"%.0f bytes" = "%.0f 字节";

/* Format used to display sizes between 1000 MB and 9.9 GB */
"%.1f GB (1.0)" = "%.1f GB";

/* Format used to display sizes between 10 and 99.9 GB */
"%.1f GB (10.0)" = "%.1f GB";

/* Format used to display sizes between 100 and 999 bytes */
"%.1f KB (0.1)" = "%.1f KB";

/* Format used to display sizes between 1000 bytes and 9.9 KB */
"%.1f KB (1.0)" = "%.1f KB";

/* Format used to display sizes between 10 and 99.9 KB */
"%.1f KB (10.0)" = "%.1f KB";

/* Format used to display sizes between 1000 KB and 9.9 MB */
"%.1f MB (1.0)" = "%.1f MB";

/* Format used to display sizes between 10 and 99.9 MB */
"%.1f MB (10.0)" = "%.1f MB";

/* Format string for label of a saved password in Keychain: URL (USERNAME) */
"%@ (%@)" = "%@（%@）";

/* Format used to partial byte count along with total */
"%@ of %@" = "%@ / %@";

/* String used for showing a zero byte size */
"0 bytes" = "0 字节";

/* String used for showing a one byte size */
"1 byte" = "1 字节";

/* WebFoundationErrorCannotCreateFile description */
"Cannot create file" = "不能创建文件";

/* WebFoundationErrorCannotMoveFile description */
"Cannot move file" = "不能移动文件";

/* WebFoundationErrorCannotOpenFile description */
"Cannot open file" = "不能打开文件";

/* WebFoundationErrorCannotRemoveFile description */
"Cannot remove file" = "不能移去文件";

/* WebFoundationErrorCannotWriteToFile description */
"Cannot write file" = "不能写文件";

/* WebFoundationErrorDNSLookupError description */
"DNS lookup error" = "DNS 查找错误";

/* WebFoundationErrorDownloadDecodingFailedMidStream description */
"Download decoding failed (at end)" = "下载解码失败";

/* WebFoundationErrorDownloadDecodingFailedToComplete description */
"Download decoding failed (midstream)" = "下载解码失败";

/* WebFoundationErrorCannotCloseFile description */
"Failure occurred while closing file" = "关闭文件时失败";

/* Kind string used for keychain items from forms-based logins */
"Web form password" = "网络表单密码";

/* HTTP result code string */
"accepted" = "已接受";

/* WebFoundationErrorBadURLError description */
"bad URL" = "错误的 URL";

/* HTTP result code string */
"bad gateway" = "错误的网关";

/* HTTP result code string */
"bad request" = "错误的请求";

/* WebFoundationErrorServerCertificateHasUnknownRoot description */
"bad server certificate" = "错误的服务器证书";

/* WebFoundationErrorBadServerResponseError description */
"bad server response" = "错误的服务器响应";

/* WebFoundationErrorCannotDecodeRawData description */
"cannot decode raw data" = "不能对 raw 数据解码";

/* WebFoundationErrorCannotDecodeContentData description */
"cannot decode content data" = "不能对内容数据解码";

/* WebFoundationErrorCannotParseResponse description */
"cannot parse response" = "不能解析响应";

/* WebFoundationErrorCancelled description */
"cancelled" = "已取消";

/* WebFoundationErrorCannotConnectToHostError description */
"can't connect to host" = "不能连接到主机";

/* WebFoundationErrorCannotFindHostError description */
"can't find host" = "找不到主机";

/* WebFoundationErrorCannotLoadFromNetworkError description */
"can't load from network" = "不能从网络载入";

/* HTTP result code string */
"client error" = "客户端错误";

/* HTTP result code string */
"conflict" = "冲突";

/* HTTP result code string */
"continue" = "继续";

/* HTTP result code string */
"created" = "已创建";

/* WebFoundationErrorReadStreamError description */
"error reading stream" = "读取流时出错";

/* HTTP result code string */
"expectation failed" = "预期失败";

/* WebFoundationErrorServerCertificateHasBadDate description */
"expired server certificate" = "过期的服务器证书";

/* WebFoundationErrorFileDoesNotExist description */
"file doesn't exist" = "文件不存在";

/* WebFoundationErrorFileIsDirectory description */
"file is directory" = "文件是目录";

/* HTTP result code string */
"forbidden" = "已禁止";

/* HTTP result code string */
"found" = "已找到";

/* HTTP result code string */
"gateway timed out" = "网关超时";

/* HTTP result code string */
"informational" = "信息";

/* HTTP result code string */
"internal server error" = "内部服务器错误";

/* HTTP result code string */
"length required" = "需要的长度";

/* WebFoundationErrorNetworkConnectionLostError description */
"lost network connection" = "网络连接已断开";

/* HTTP result code string */
"method not allowed" = "不允许的方式";

/* HTTP result code string */
"moved permanently" = "永久移去";

/* HTTP result code string */
"multiple choices" = "多个选择";

/* HTTP result code string */
"needs proxy" = "需要代理";

/* WebFoundationErrorNotConnectedToInternetError description */
"no Internet connection" = "无 Internet 连接";

/* HTTP result code string */
"no content" = "无内容";

/* HTTP result code string */
"no error" = "无错误";

/* HTTP result code string */
"no longer exists" = "不再存在";

/* WebFoundationErrorNoPermissionsToReadFile description */
"no permissions to read file" = "无读取文件的权限";

/* HTTP result code string */
"non-authoritative information" = "无需授权的信息";

/* HTTP result code string */
"not found" = "未找到";

/* HTTP result code string */
"not modified" = "未修改";

/* HTTP result code string */
"partial content" = "部分内容";

/* HTTP result code string */
"payment required" = "需要付费";

/* HTTP result code string */
"precondition failed" = "前提条件失败";

/* HTTP result code string */
"proxy authentication required" = "需要代理鉴定";

/* HTTP result code string */
"redirected" = "重定向";

/* WebFoundationErrorRedirectToNonExistentLocation description */
"redirected to nowhere" = "不重定向到任何地方";

/* HTTP result code string */
"request timed out" = "请求超时";

/* HTTP result code string */
"request too large" = "请求太大";

/* HTTP result code string */
"requested URL too long" = "请求的 URL 太长";

/* HTTP result code string */
"requested range not satisfiable" = "不能满足客户请求的范围";

/* HTTP result code string */
"reset content" = "重置内容";

/* WebFoundationErrorResourceUnavailableError description */
"resource unavailable" = "无可用资源";

/* WebFoundationErrorSecureConnectionFailed description */
"secure connection failed" = "安全连接失败";

/* HTTP result code string */
"see other" = "查看其他";

/* HTTP result code string */
"server error" = "服务器错误";

/* HTTP result code string */
"service unavailable" = "无可用的服务";

/* HTTP result code string */
"success" = "成功";

/* HTTP result code string */
"switching protocols" = "切换协议";

/* HTTP result code string */
"temporarily redirected" = "暂时重定向";

/* WebFoundationErrorTimedOut description */
"timed out" = "超时";

/* WebFoundationErrorHTTPTooManyRedirectsError description */
"too many HTTP redirects" = "太多的 HTTP 重定向";

/* HTTP result code string */
"unacceptable" = "不可接受";

/* HTTP result code string */
"unauthorized" = "未经授权";

/* HTTP result code string */
"unimplemented" = "未实现";

/* Unknown filename */
"unknown" = "未知";

/* WebFoundationErrorUnsupportedURL description */
"unsupported URL" = "不被支持的 URL";

/* HTTP result code string */
"unsupported media type" = "不被支持的媒体类型";

/* HTTP result code string */
"unsupported version" = "不被支持的版本";

/* WebFoundationErrorServerCertificateUntrusted description */
"untrusted server certificate" = "不被信任的服务器证书";

/* WebFoundationErrorZeroByteResourceError description */
"zero byte resource" = "0 字节资源";

/* WebFoundationErrorDataLengthExceedsMaximum description */
"resource exceeds maximum size" = "资源超过了最大大小";
